<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"4b6aa7c2e724868a152c668c4c734e6d05ddcd0db2941b528b783ebb22be4979","plan_job_ref":"Job Staging Environment #79 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9138073091","plan_out_hash":"8c85e9f3c672e62d51c358794f645554977727e6ebe046391cc6e217866fce24","plan_hash":"bb1242aacaf273faa9f8d9652c9d411a5f21bfc03ebb063d720fa34f070b0c40","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 12 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.breakpoints-min-js will be updated in-place
!~  resource "aws_s3_object" "breakpoints-min-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "breakpoints.min.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.browser-min-js will be updated in-place
!~  resource "aws_s3_object" "browser-min-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "browser.min.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.jquery-min-js will be updated in-place
!~  resource "aws_s3_object" "jquery-min-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "jquery.min.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.jquery-scrollex-min-js will be updated in-place
!~  resource "aws_s3_object" "jquery-scrollex-min-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "jquery.scrollex.min.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.jquery-scrolly-min-js will be updated in-place
!~  resource "aws_s3_object" "jquery-scrolly-min-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "jquery.scrolly.min.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.main-css will be updated in-place
!~  resource "aws_s3_object" "main-css" {
!~      content_type                  = "application/octet-stream" -> "text/css"
        id                            = "main.css"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.main-js will be updated in-place
!~  resource "aws_s3_object" "main-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "main.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.noscript-css will be updated in-place
!~  resource "aws_s3_object" "noscript-css" {
!~      content_type                  = "application/octet-stream" -> "text/css"
        id                            = "noscript.css"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.photo will be updated in-place
!~  resource "aws_s3_object" "photo" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "pic01-vintage2.jpg"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.util-js will be updated in-place
!~  resource "aws_s3_object" "util-js" {
!~      content_type                  = "application/octet-stream" -> "application/javascript"
        id                            = "util.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

Plan: 0 to add, 12 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #79](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9138073091)